snlkuharlocal/src/Documents/Матрица/Матрица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Матрица</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтсрочкаПлатежа</name>
    <type>
      <types>CatalogRef.ОтсрочкиПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеРазрешено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборПечатныхФорм</name>
    <type>
      <types>CatalogRef.НаборыПечатныхФорм</types>
    </type>
  </attributes>
  <attributes>
    <name>МакетЭтикетки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостояннаяАкция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСкановДоговоров</name>
    <type>
      <types>EnumRef.СостоянияСкановДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийСБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидМатрицы</name>
    <type>
      <types>CatalogRef.ВидМатрицы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ШККонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АртикулКонтрагента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальноеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПосредника</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этикетка1</name>
      <type>
        <types>CatalogRef.НастройкиПечатиЭтикеток</types>
      </type>
    </attributes>
    <attributes>
      <name>Этикетка2</name>
      <type>
        <types>CatalogRef.НастройкиПечатиЭтикеток</types>
      </type>
    </attributes>
    <attributes>
      <name>Этикетка3</name>
      <type>
        <types>CatalogRef.НастройкиПечатиЭтикеток</types>
      </type>
    </attributes>
    <attributes>
      <name>Этикетка4</name>
      <type>
        <types>CatalogRef.НастройкиПечатиЭтикеток</types>
      </type>
    </attributes>
    <attributes>
      <name>Этикетка5</name>
      <type>
        <types>CatalogRef.НастройкиПечатиЭтикеток</types>
      </type>
    </attributes>
    <attributes>
      <name>ШККонтрагентаБлочок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШККонтрагентаКоробка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КратностьКоробки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеКонтрагента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодПроизводителяКонтрагента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШКСпайки</name>
      <comment>Для свертки в спайки при выгрузке в екод (Тандер 7 континент и т.д.)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипУпаковки</name>
      <type>
        <types>CatalogRef.ТипыУпаковки</types>
      </type>
    </attributes>
    <attributes>
      <name>КолКоробовВСлое</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВысотаПаллета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШККонтрагентаДополнительный</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйОстатокКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйОстатокВДнях</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеБрендаДляКонтрагента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЦветаДляКонтрагента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеРазмераДляКонтрагента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТовараДляКонтрагента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПороговаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КратностьПаллеты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособПоставки</name>
      <type>
        <types>EnumRef.СпособПоставкиКонтрагенту</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыделятьВДокументах</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставки</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокУчастияВАкции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выгружать0Ост</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаРаботыСМаркировкой</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаПродаж</name>
      <comment>изм.0000000148</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыДопОбработок</name>
    <attributes>
      <name>ДопОбработка</name>
      <type>
        <types>CatalogRef.ВидыДопОбработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>ExchangePlanRef.Основной</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПунктыДоставки</name>
    <attributes>
      <name>ПунктДоставки</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сканы</name>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаДобавления</name>
      <type>
        <types>CatalogRef.ПричиныДобавленияСканов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбязательноДобавлениеСкана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерХранения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/РеквизитыДокументов/РеквизитыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыДокументов</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>DocumentRef.Матрица</types>
      <types>Boolean</types>
      <types>String</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef.Перемещение</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Матрица</types>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.ЗаявкаВТранспортныйОтдел</types>
      <types>DocumentRef.ЗаданиеНабора</types>
      <types>DocumentRef.СчетФактура</types>
      <types>DocumentRef.ЗаказКлиентаFBS</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/Матрица/ManagerModule.bsl
// Кельманов А.В. - ASU-2019 - 2025.02.12
Функция ОпределитьМатрицуНаКомплектующие(Матрица) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.РеквизитыДокументов.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Документ = Матрица;
	МенеджерЗаписи.ИмяРеквизита = "МатрицаНаКомплектующие"; 
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат МенеджерЗаписи.ЗначениеРеквизита;	
	Иначе
		Возврат Справочники.ВремяПриемки.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции
